app/controllers/api/v1/messages_controller.rb

      def create
        user = User.find_by_email(message_params[:receiver_email]) # find user by email instead of id
        @message = Message.new(message_params.merge(from: current_user.id)) # adds current_user id as sender of the message
        if user
          @message.to = user.id
        end # if user is not found , message is rejected

        if @message.save
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "master@email.com"], ["LIMIT", 1]]
INSERT INTO "messages" ("title", "content", "from", "to", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "apiteste"], ["content", "conteudo top"], ["from", 2], ["to", 1], ["created_at", "2020-08-28 17:50:44.521046"], ["updated_at", "2020-08-28 17:50:44.521046"]]

      def archive
        @message = Message.find(params[:id])
---
SELECT  "messages".* FROM "messages" WHERE "messages"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

      def archive_multiple
        messages = Message.find(params[:messages_ids])
---
SELECT  "messages".* FROM "messages" WHERE "messages"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]