app/controllers/api/v1/users_controller.rb

      def update
        if user_params[:password].blank? || user_params[:password_confirmation].blank? # remove password if both fields are not filled
          params[:user].delete(:password)
          params[:user].delete(:password_confirmation)
        end

        if @user.update(user_params)
---
UPDATE "users" SET "name" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["name", "TESTE"], ["updated_at", "2020-08-30 01:05:28.622509"], ["id", 1]]

      def messages
        @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 2], ["LIMIT", 1]]